Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-GC_DFP/1.0.131/PIC32CK-GC00/atdf/PIC32CK2051GC00144.atdf
        <register name="CHSTATBC" offset="0x40" rw="R" size="4" initval="0x00000000" caption="CHANNEL STATUS BLOCK COUNT REGISTER">
          <bitfield name="BBTC" caption="Bytes Transfered in the Block Counter" mask="0x1FFFF"/>
        </register>
        <register name="CHSTATCC" offset="0x44" rw="R" size="4" initval="0x00000000" caption="CHANNEL STATUS CELL COUNT REGISTER">
          <bitfield name="CBTC" caption="Bytes Transfered in the Cell Counter" mask="0x7FF"/>
        </register>
        <register name="CHSTAT" offset="0x48" rw="R" size="4" initval="0x00000000" caption="CHANNEL STATUS REGISTER">
          <bitfield name="BLKBUSY" caption="Channel Block Transfer Busy Status Bit (0: none; 1: busy)" mask="0x1"/>
          <bitfield name="CELLBUSY" caption="Channel Cell Transfer Busy Status Bit (0: none; 1: busy)" mask="0x2"/>
          <bitfield name="DREAD" caption="Descriptor Read Status Bit (0: not read or not avail, 1: read and loaded)" mask="0x4"/>
        </register>
      </register-group>
      <register-group name="DMA" caption="Direct Memory Access Controller">
        <register name="CTRLA" offset="0x0" rw="RW" size="4" initval="0x00000000" caption="DMA CONTROL A REGISTER">
          <bitfield name="ENABLE" caption="DMA Enable" mask="0x2"/>
        </register>
        <register name="CTRLB" offset="0x4" rw="RW" size="4" initval="0x00000000" caption="DMA CONTROL B REGISTER">
          <bitfield name="QOS1" caption="Priority Group 1 Quality Of Service Control" mask="0x3" values="CTRLB__QOS1"/>
          <bitfield name="QOS2" caption="Priority Group 2 Quality Of Service Control" mask="0x300" values="CTRLB__QOS2"/>
          <bitfield name="QOS3" caption="Priority Group 3 Quality Of Service Control" mask="0x30000" values="CTRLB__QOS3"/>
          <bitfield name="QOS4" caption="Priority Group 4 Quality Of Service Control" mask="0x3000000" values="CTRLB__QOS4"/>
        </register>
        <register name="DBGCTRL" offset="0x8" rw="RW" size="4" initval="0x00000000" caption="DEBUG CONTROL REGISTER">
          <bitfield name="DBGRUN" caption="Debug Run" mask="0x1"/>
        </register>
        <register name="CRCPOLYA" offset="0xC" rw="RW" size="4" initval="0x00000000" caption="DMA CRC POLYNOMIAL A REGISTER">
          <bitfield name="POLYA" caption="CRC Polynomial Coefficients A Register" mask="0xFFFFFFFF"/>
        </register>
        <register name="CRCPOLYB" offset="0x10" rw="RW" size="4" initval="0x00000000" caption="DMA CRC POLYNOMIAL B REGISTER">
          <bitfield name="POLYB" caption="CRC Polynomial Coefficients B Register" mask="0xFFFFFFFF"/>
        </register>
        <register name="INTSTAT3" offset="0x18" rw="R" size="4" initval="0x00000000" caption="DMA INTERRUPT PRIORITY 3 STATUS REGISTER">
          <bitfield name="CH0" caption="DMA Channel active interrupt at priority 3" mask="0x1"/>
          <bitfield name="CH1" caption="DMA Channel active interrupt at priority 3" mask="0x2"/>
          <bitfield name="CH2" caption="DMA Channel active interrupt at priority 3" mask="0x4"/>
          <bitfield name="CH3" caption="DMA Channel active interrupt at priority 3" mask="0x8"/>
          <bitfield name="CH4" caption="DMA Channel active interrupt at priority 3" mask="0x10"/>
          <bitfield name="CH5" caption="DMA Channel active interrupt at priority 3" mask="0x20"/>
          <bitfield name="CH6" caption="DMA Channel active interrupt at priority 3" mask="0x40"/>
          <bitfield name="CH7" caption="DMA Channel active interrupt at priority 3" mask="0x80"/>
          <bitfield name="CH8" caption="DMA Channel active interrupt at priority 3" mask="0x100"/>
          <bitfield name="CH9" caption="DMA Channel active interrupt at priority 3" mask="0x200"/>
          <bitfield name="CH10" caption="DMA Channel active interrupt at priority 3" mask="0x400"/>
          <bitfield name="CH11" caption="DMA Channel active interrupt at priority 3" mask="0x800"/>
          <bitfield name="CH12" caption="DMA Channel active interrupt at priority 3" mask="0x1000"/>
          <bitfield name="CH13" caption="DMA Channel active interrupt at priority 3" mask="0x2000"/>
          <bitfield name="CH14" caption="DMA Channel active interrupt at priority 3" mask="0x4000"/>
          <bitfield name="CH15" caption="DMA Channel active interrupt at priority 3" mask="0x8000"/>
          <bitfield name="CH16" caption="DMA Channel active interrupt at priority 3" mask="0x10000"/>
          <bitfield name="CH17" caption="DMA Channel active interrupt at priority 3" mask="0x20000"/>
          <bitfield name="CH18" caption="DMA Channel active interrupt at priority 3" mask="0x40000"/>
          <bitfield name="CH19" caption="DMA Channel active interrupt at priority 3" mask="0x80000"/>
          <bitfield name="CH20" caption="DMA Channel active interrupt at priority 3" mask="0x100000"/>
          <bitfield name="CH21" caption="DMA Channel active interrupt at priority 3" mask="0x200000"/>
          <bitfield name="CH22" caption="DMA Channel active interrupt at priority 3" mask="0x400000"/>
          <bitfield name="CH23" caption="DMA Channel active interrupt at priority 3" mask="0x800000"/>
        </register>
        <register name="INTSTAT2" offset="0x1C" rw="R" size="4" initval="0x00000000" caption="DMA INTERRUPT PRIORITY 2 STATUS REGISTER">
          <bitfield name="CH0" caption="DMA Channel active interrupt at priority 2" mask="0x1"/>
          <bitfield name="CH1" caption="DMA Channel active interrupt at priority 2" mask="0x2"/>
          <bitfield name="CH2" caption="DMA Channel active interrupt at priority 2" mask="0x4"/>
          <bitfield name="CH3" caption="DMA Channel active interrupt at priority 2" mask="0x8"/>
          <bitfield name="CH4" caption="DMA Channel active interrupt at priority 2" mask="0x10"/>
          <bitfield name="CH5" caption="DMA Channel active interrupt at priority 2" mask="0x20"/>
          <bitfield name="CH6" caption="DMA Channel active interrupt at priority 2" mask="0x40"/>
          <bitfield name="CH7" caption="DMA Channel active interrupt at priority 2" mask="0x80"/>
          <bitfield name="CH8" caption="DMA Channel active interrupt at priority 2" mask="0x100"/>
          <bitfield name="CH9" caption="DMA Channel active interrupt at priority 2" mask="0x200"/>
          <bitfield name="CH10" caption="DMA Channel active interrupt at priority 2" mask="0x400"/>
          <bitfield name="CH11" caption="DMA Channel active interrupt at priority 2" mask="0x800"/>
          <bitfield name="CH12" caption="DMA Channel active interrupt at priority 2" mask="0x1000"/>
          <bitfield name="CH13" caption="DMA Channel active interrupt at priority 2" mask="0x2000"/>
          <bitfield name="CH14" caption="DMA Channel active interrupt at priority 2" mask="0x4000"/>
          <bitfield name="CH15" caption="DMA Channel active interrupt at priority 2" mask="0x8000"/>
          <bitfield name="CH16" caption="DMA Channel active interrupt at priority 2" mask="0x10000"/>
          <bitfield name="CH17" caption="DMA Channel active interrupt at priority 2" mask="0x20000"/>
          <bitfield name="CH18" caption="DMA Channel active interrupt at priority 2" mask="0x40000"/>
          <bitfield name="CH19" caption="DMA Channel active interrupt at priority 2" mask="0x80000"/>
          <bitfield name="CH20" caption="DMA Channel active interrupt at priority 2" mask="0x100000"/>
          <bitfield name="CH21" caption="DMA Channel active interrupt at priority 2" mask="0x200000"/>
          <bitfield name="CH22" caption="DMA Channel active interrupt at priority 2" mask="0x400000"/>
          <bitfield name="CH23" caption="DMA Channel active interrupt at priority 2" mask="0x800000"/>
        </register>
        <register name="INTSTAT1" offset="0x20" rw="R" size="4" initval="0x00000000" caption="DMA INTERRUPT PRIORITY 1 STATUS REGISTER">
          <bitfield name="CH0" caption="DMA Channel active interrupt at priority 1" mask="0x1"/>
          <bitfield name="CH1" caption="DMA Channel active interrupt at priority 1" mask="0x2"/>
          <bitfield name="CH2" caption="DMA Channel active interrupt at priority 1" mask="0x4"/>
          <bitfield name="CH3" caption="DMA Channel active interrupt at priority 1" mask="0x8"/>
          <bitfield name="CH4" caption="DMA Channel active interrupt at priority 1" mask="0x10"/>
          <bitfield name="CH5" caption="DMA Channel active interrupt at priority 1" mask="0x20"/>
          <bitfield name="CH6" caption="DMA Channel active interrupt at priority 1" mask="0x40"/>
          <bitfield name="CH7" caption="DMA Channel active interrupt at priority 1" mask="0x80"/>
          <bitfield name="CH8" caption="DMA Channel active interrupt at priority 1" mask="0x100"/>
          <bitfield name="CH9" caption="DMA Channel active interrupt at priority 1" mask="0x200"/>
          <bitfield name="CH10" caption="DMA Channel active interrupt at priority 1" mask="0x400"/>
          <bitfield name="CH11" caption="DMA Channel active interrupt at priority 1" mask="0x800"/>
          <bitfield name="CH12" caption="DMA Channel active interrupt at priority 1" mask="0x1000"/>
          <bitfield name="CH13" caption="DMA Channel active interrupt at priority 1" mask="0x2000"/>
          <bitfield name="CH14" caption="DMA Channel active interrupt at priority 1" mask="0x4000"/>
          <bitfield name="CH15" caption="DMA Channel active interrupt at priority 1" mask="0x8000"/>
          <bitfield name="CH16" caption="DMA Channel active interrupt at priority 1" mask="0x10000"/>
          <bitfield name="CH17" caption="DMA Channel active interrupt at priority 1" mask="0x20000"/>
          <bitfield name="CH18" caption="DMA Channel active interrupt at priority 1" mask="0x40000"/>
          <bitfield name="CH19" caption="DMA Channel active interrupt at priority 1" mask="0x80000"/>
          <bitfield name="CH20" caption="DMA Channel active interrupt at priority 1" mask="0x100000"/>
          <bitfield name="CH21" caption="DMA Channel active interrupt at priority 1" mask="0x200000"/>
          <bitfield name="CH22" caption="DMA Channel active interrupt at priority 1" mask="0x400000"/>
          <bitfield name="CH23" caption="DMA Channel active interrupt at priority 1" mask="0x800000"/>
        </register>
        <register-group name="CHANNEL" name-in-module="CHANNEL" offset="0x50" size="0x50" count="8"/>
      </register-group>
      <register-group name="DMA_DESCRIPTOR" caption="Direct Memory Access Controller" section="hsram" aligned="4">
        <register name="BDNXT" offset="0x0" rw="RW" size="4" initval="0x00000000" caption="NEXT BUFFER DESCRIPTOR ADDRESS POINTER">
          <bitfield name="NXT" caption="Next Descriptor Pointer" mask="0xFFFFFFFF"/>
        </register>
        <register name="BDCFG" offset="0x4" rw="RW" size="4" initval="0x00000000" caption="CURRENT BUFFER DESCRIPTOR CONFIGURATION">
          <bitfield name="CTRLB" caption="CTRLB Register Descriptor Load" mask="0x1"/>
          <bitfield name="EVCTRL" caption="EVCTRL Register Descriptor Load" mask="0x2"/>
          <bitfield name="SSA" caption="SSA Register Descriptor Load" mask="0x4"/>
          <bitfield name="DSA" caption="DSA Register Descriptor Load" mask="0x8"/>
          <bitfield name="SSTRD" caption="SSTRD Register Descriptor Load" mask="0x10"/>
          <bitfield name="DSTRD" caption="DSTRD Register Descriptor Load" mask="0x20"/>
          <bitfield name="XSIZ" caption="XSIZ Register Descriptor Load" mask="0x40"/>
          <bitfield name="PDAT" caption="PDAT Register Descriptor Load" mask="0x80"/>
          <bitfield name="CTRLCRC" caption="CTRLCRC Register Descriptor Load" mask="0x100"/>
          <bitfield name="CRCDAT" caption="CRCDAT Register Descriptor Load" mask="0x200"/>
          <bitfield name="ENABLE" caption="Channel Enable" mask="0x1000000"/>
          <bitfield name="LLEN" caption="Linked List Enable" mask="0x2000000"/>
          <bitfield name="SWFRC" caption="Software Forced Trigger" mask="0x4000000"/>
          <bitfield name="RUNSTDBY" caption="Run In Standby" mask="0x8000000"/>
        </register>
        <register name="BDCTRLB" offset="0x8" rw="RW" size="4" initval="0x00000000" caption="CURRENT BUFFER DESCRIPTOR CONTROL REGISTER B">
          <bitfield name="WAS" caption="Channel Write Address Sequence." mask="0x7" values="BDCTRLB__WAS"/>
          <bitfield name="RAS" caption="Channel Read Address Sequence" mask="0x70" values="BDCTRLB__RAS"/>
          <bitfield name="PRI" caption="Channel Priority level." mask="0x300" values="BDCTRLB__PRI"/>
          <bitfield name="WBOEN" caption="Write Byte Order Enable" mask="0x2000"/>
          <bitfield name="BYTORD" caption="Byte Order" mask="0xC000" values="BDCTRLB__BYTORD"/>
          <bitfield name="TRIG" caption="Trigger that can Start a Channel Transfer" mask="0xFF0000"/>
          <bitfield name="PIGNEN" caption="Enable Pattern Ignore Byte" mask="0x1000000"/>
          <bitfield name="PATLEN" caption="Pattern Match Length" mask="0x2000000"/>
          <bitfield name="PATEN" caption="Channel Pattern Match Abort Enable." mask="0x4000000"/>
          <bitfield name="CASTEN" caption="Cell Auto Start Enable of Ensuing Transfers for this channel" mask="0x20000000"/>
          <bitfield name="CRCEN" caption="CRC Enable bit" mask="0x80000000"/>
        </register>
        <register name="BDEVCTRL" offset="0xC" rw="RW" size="2" initval="0x0000" caption="CURRENT BUFFER DESCRIPTOR EVENT CONTROL">
          <bitfield name="EVAUXACT" caption="Channel Auxiliary Event Input Action" mask="0x3" values="BDEVCTRL__EVAUXACT"/>
          <bitfield name="EVOMODE" caption="Channel Event Output Mode" mask="0xC" values="BDEVCTRL__EVOMODE"/>
          <bitfield name="EVAUXIE" caption="Channel Auxiliary Event Enable (0: disable; 1: enable)" mask="0x20"/>
          <bitfield name="EVSTRIE" caption="Channel Start Event Input Enable (0: disable; 1:enable)" mask="0x40"/>
          <bitfield name="EVOE" caption="Channel Event Output Enable (0: disable; 1: enable)" mask="0x80"/>
        </register>
